// Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).

for (let i = 20; i <= 30; i=i+0.5) {
    console.log(i);
}

// Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.

const dollar = 27;

for (let i = 10; i <= 100; i=i+10) {
    console.log(dollar * i);
}

// Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.

const number = 50;

for (let i = 1; i <= 100; i++) {

    if (i**2 < number) {
        console.log(i);
    } 

}

 // Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).

function primality(n) {

    for(let i = 2; i < n; i++) {
       if(n % i === 0) return false;
    }
    return n > 1;
   }

// Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

function isPowerOfThree(num) {

    while (num % 3 == 0) {
      num /= 3;
    }
    return num == 1;
  }
  
  console.log(isPowerOfThree(81));
  console.log(isPowerOfThree(13));






